OFsolvers/tutorial_cases/loop_reactor_msh/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
vertices
(
 (-1 -1 -3)
 (11 -1 -3)
 (11  6 -3)
 (-1 6 -3)
 (-1 -1 3)
 (11 -1 3)
 (11 6 3)
 (-1 6 3)

);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
blocks
(

 //block 0
hex (0 1 2 3 4 5 6 7 )
( 120 70 60 )
SimpleGrading (1 1 1)

);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
defaultPatch
{   type wall;}

patches
(
);
